# This is a file written in Emacs and authored using org-mode (http://orgmode.org/)
# The "README.md" file is generated from this file by running the
# "M-x org-md-export-to-markdown" command from inside of Emacs.
# 
# The "cleaner.py" file is generated from this file by running the
# "M-x org-babel-tangle" command from inside of Emacs.
# 
# Don't render a Table of Contents 
#+OPTIONS: toc:nil
# Don't render section numbers
#+OPTIONS: num:nil
# Turn of subscript parsing: http://super-user.org/wordpress/2012/02/02/how-to-get-rid-of-subscript-annoyance-in-org-mode/comment-page-1/
#+OPTIONS: ^:{}
** DONE First pass at converting this repository to a literate document
   Aside from finding one mistake (see below) =M-x org-babel-tangle=
   doesn't result in any changes when I do a =git diff= after the
   =org-babel-tangle=!

   #+BEGIN_EXAMPLE
     $ git diff app.py 
     diff --git a/app.py b/app.py
     index 93421c2..ee088e3 100644
     --- a/app.py
     +++ b/app.py
     @@ -140,7 +140,6 @@ def cat_sstv_wav(id):
          cat.image_scale_to_martin_m2()
          rv = live_martin_m2_renderer(cat.image)
          timeout = 14400  # 4 hours
     -    # timeout = 604800 # 1 week
          rv.headers['Cache-Timeout'] = timeout
          return rv
   #+END_EXAMPLE
   CLOCK: [2015-12-16 Wed 23:02]--[2015-12-17 Thu 00:14] =>  1:12
** DONE Save, and push back to GitHub
   CLOCK: [2015-12-17 Thu 00:15]--[2015-12-17 Thu 00:17] =>  0:02
** DONE Add in .gitignore
   CLOCK: [2015-12-17 Thu 00:17]--[2015-12-17 Thu 00:19] =>  0:02
** DONE Fix FIXME images
   CLOCK: [2015-12-17 Thu 00:19]--[2015-12-17 Thu 00:30] =>  0:11
** DONE Link to original Twilio post
   CLOCK: [2015-12-17 Thu 00:30]--[2015-12-17 Thu 00:32] =>  0:02
